sexy_calculator/app/controllers/orders_controller.rb

	def create
		# get data from the form
		order_params = params.require(:order).permit(:user_id, :width, :depth, :height, :distance, :additional_slack, :starting_u, :ending_u, :racks_crossed, :racks_through, :aisles)
		#give the data to the model
		@order = Order.new(order_params)
		#save the model
		if @order.save
---
INSERT INTO "orders" ("additional_slack", "aisles", "created_at", "depth", "distance", "ending_u", "height", "racks_crossed", "racks_through", "starting_u", "updated_at", "user_id", "width") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

	def update
		# get data from the form
		order_params = params.require(:order).permit(:user_id, :width, :depth, :height, :distance, :additional_slack, :starting_u, :ending_u, :racks_crossed, :racks_through, :aisles)
		#give the data to the model
		@order = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders"  WHERE "orders"."id" = ? LIMIT 1  [["id", 1]]