baking-app/app/views/bakers/show.html.erb

  <ul>
  <% @baker.recipes.each do |recipe| %>
---
SELECT "recipes".* FROM "recipes"  WHERE "recipes"."baker_id" = ?  [["baker_id", 1]]