baking-app/app/controllers/bakers_controller.rb

SELECT "bakers".* FROM "bakers"
---
  def index
    @bakers = Baker.all

INSERT INTO "bakers" ("cooking_school", "created_at", "name", "updated_at", "zip_code") VALUES (?, ?, ?, ?, ?)  [["cooking_school", "t"], ["created_at", "2014-12-09 02:45:32.243408"], ["name", "Cody"], ["updated_at", "2014-12-09 02:45:32.243408"], ["zip_code", 84780]]
---
  def create
    @baker = Baker.new(baker_params)

    respond_to do |format|
      if @baker.save

UPDATE "bakers" SET "gluten_free" = ?, "updated_at" = ? WHERE "bakers"."id" = 1  [["gluten_free", "f"], ["updated_at", "2014-12-05 19:38:17.168521"]]
---
  def update
    respond_to do |format|
      if @baker.update(baker_params)

SELECT  "bakers".* FROM "bakers"  WHERE "bakers"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_baker
      @baker = Baker.find(params[:id])