baking-app/app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("baker_id", "created_at", "date_added", "gluton_free", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["baker_id", 2], ["created_at", "2014-12-11 22:25:17.617136"], ["date_added", "2001-01-01"], ["gluton_free", "t"], ["name", "red velvet cupcakes"], ["updated_at", "2014-12-11 22:25:17.617136"]]
---
  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save

UPDATE "recipes" SET "name" = ?, "updated_at" = ? WHERE "recipes"."id" = 2  [["name", "red velvet oreo cupcakes"], ["updated_at", "2014-12-11 22:54:24.103414"]]
---
  def update
    respond_to do |format|
      if @recipe.update(recipe_params)