traditions_book/app/controllers/pictures_controller.rb

	def create
		# get data from the form
		picture_params = params.require(:picture).permit(:url, :user_id, :tradition_id, :approved)
		#give the data to the model
		@picture = Picture.new(picture_params)
		#save the model
		if @picture.save
---
INSERT INTO "pictures" ("approved", "created_at", "tradition_id", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["approved", "t"], ["created_at", "2015-02-07 05:09:34.806367"], ["tradition_id", 1], ["updated_at", "2015-02-07 05:09:34.806367"], ["url", "test.jpg"], ["user_id", 1]]