traditions_book/app/controllers/ratings_controller.rb

SELECT  "traditions".* FROM "traditions"  WHERE "traditions"."id" = ? LIMIT 1  [["id", "id"]]
---
	def new
		#@rating = Rating.new
		@tradition = Tradition.find(params[:tradition_id])

SELECT  "traditions".* FROM "traditions"  WHERE "traditions"."id" = ? LIMIT 1  [["id", 11]]
---
	def create
		# get data from the form
		@rating.tradition = Tradition.find(params[:tradition_id])

DELETE FROM "ratings" WHERE "ratings"."id" = ?  [["id", 3]]
---
	def destroy
		@rating.destroy