traditions_book/app/controllers/ratings_controller.rb

	def create
		# get data from the form
		rating_params = params.require(:rating).permit(:rating_number, :tradition_id, :user_id)
		#give the data to the model
		@rating = Rating.new(rating_params)
		#save the model
		if @rating.save
---
INSERT INTO "ratings" ("created_at", "rating_number", "tradition_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-02-18 05:22:49.353637"], ["rating_number", 5], ["tradition_id", 4], ["updated_at", "2015-02-18 05:22:49.353637"], ["user_id", 1]]

	def edit
		@rating = Rating.find(params[:id])
---
SELECT  "ratings".* FROM "ratings"  WHERE "ratings"."id" = ? LIMIT 1  [["id", 2]]

	def update
		#get data from form
		rating_params = params.require(:rating).permit(:rating_number, :tradition_id, :user_id)
		#find the existing
		@rating = Rating.find(params[:id])
		#update the picture with new params
		@rating.update(rating_params)
---
SELECT  "ratings".* FROM "ratings"  WHERE "ratings"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "ratings" SET "updated_at" = ?, "user_id" = ? WHERE "ratings"."id" = 2  [["updated_at", "2015-02-19 00:43:22.965888"], ["user_id", 2]]