traditions_book/app/controllers/traditions_controller.rb

	def index
		@traditions = Tradition.all
---
SELECT "traditions".* FROM "traditions"

	def create
		# get data from the form
		tradition_params = params.require(:tradition).permit(:rating, :name, :description, :approved)
		#give the data to the model
		@tradition = Tradition.new(tradition_params)
		@tradition.user = current_user
		#save the model
		if @tradition.save
---
INSERT INTO "traditions" ("approved", "created_at", "name", "picture", "poster", "ranking", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["approved", "f"], ["created_at", "2015-02-01 02:57:30.673078"], ["name", "test"], ["picture", "0"], ["poster", "Cody"], ["ranking", 4], ["updated_at", "2015-02-01 02:57:30.673078"]]

	def show
		@tradition = Tradition.find(params[:id])
---
SELECT  "traditions".* FROM "traditions"  WHERE "traditions"."id" = ? LIMIT 1  [["id", 0]]

	def edit
		@tradition = Tradition.find(params[:id])
---
SELECT  "traditions".* FROM "traditions"  WHERE "traditions"."id" = ? LIMIT 1  [["id", 1]]

	def update
		#get data from form
		tradition_params = params.require(:tradition).permit(:rating, :name, :description, :approved)
		#find the existing tradition
		@tradition = Tradition.find(params[:id])
		#update the tradition with new params
		@tradition.update(tradition_params)
---
SELECT  "traditions".* FROM "traditions"  WHERE "traditions"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "traditions" SET "description" = ?, "name" = ?, "updated_at" = ? WHERE "traditions"."id" = 9  [["description", "Fire Blazing Good TIme"], ["name", "BBQ"], ["updated_at", "2015-03-03 06:10:00.476531"]]

	def destroy
		@tradition = Tradition.find(params[:id])
		@tradition.destroy
---
SELECT  "traditions".* FROM "traditions"  WHERE "traditions"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "traditions" WHERE "traditions"."id" = ?  [["id", 1]]