traditions_book/app/views/ratings/_form.html.erb

SELECT "traditions".* FROM "traditions"
---
	<%= form.label :tradition %><br />
	<%= form.collection_select :tradition_id, Tradition.all, :id, :name %>

SELECT "users".* FROM "users"
---
	<%= form.label :user %><br />
	<%= form.collection_select :user_id, User.all, :id, :name %>