baking-app/app/views/recipes/_form.html.erb

SELECT "bakers".* FROM "bakers"
---
    <%= f.label :baker %><br>
    <%= f.collection_select :baker_id, Baker.all, :id, :name %>