traditions_book/app/views/traditions/_form.html.erb

	<%= form.label :user %>
	<%= form.collection_select :user_id, User.all, :id, :name  %>
---
SELECT "users".* FROM "users"