traditions_book/app/views/traditions/_tradition.html.erb

SELECT "pictures".* FROM "pictures"  WHERE "pictures"."tradition_id" = ?  [["tradition_id", 9]]
---
	<tr>
		<% tradition.pictures.each do |picture| %>