planetarium/app/controllers/planets_controller.rb

	def create
		# get data from the form
		planet_params = params.require(:planet).permit(:name, :position, :orbital_speed, :mass, :volume)
		#give the data to the model
		@planet = Planet.new(planet_params)
		#save the model
		@planet.save
---
INSERT INTO "planets" ("created_at", "mass", "name", "orbital_speed", "position", "updated_at", "volume") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", "2015-01-28 23:50:49.922547"], ["mass", 40.2], ["name", "Earth"], ["orbital_speed", 100.0], ["position", 3], ["updated_at", "2015-01-28 23:50:49.922547"], ["volume", 5000.0]]

	def show
		@planet = Planet.find(params[:id])
---
SELECT  "planets".* FROM "planets"  WHERE "planets"."id" = ? LIMIT 1  [["id", 1]]

	def edit
		@planet = Planet.find(params[:id])
---
SELECT  "planets".* FROM "planets"  WHERE "planets"."id" = ? LIMIT 1  [["id", 3]]

	def update
		#get data from form
		planet_params = params.require(:planet).permit(:name, :position, :orbital_speed, :mass, :volume)
		#find the existing planet
		@planet = Planet.find(params[:id])
		#update the planet with new params
		@planet.update(planet_params)
---
SELECT  "planets".* FROM "planets"  WHERE "planets"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "planets" SET "mass" = ?, "updated_at" = ? WHERE "planets"."id" = 3  [["mass", 0.0], ["updated_at", "2015-01-30 23:47:12.377401"]]